RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6280/HPM6280_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM1</name>
      <description>TRGM1</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf021c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM2</name>
      <description>TRGM2</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf022c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM3</name>
      <description>TRGM3</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf023c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PLA0</name>
      <description>PLA0</description>
      <groupName>PLA</groupName>
      <baseAddress>0xf020e000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x420</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x70</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CHN[%s]</name>
          <description>no description available</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>AOI_16to8_00,AOI_16to8_01,AOI_16to8_02,AOI_16to8_03,AOI_16to8_04,AOI_16to8_05,AOI_16to8_06,AOI_16to8_07</dimIndex>
            <name>AOI_16TO8[%s]</name>
            <description>no description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AOI_16TO8_15</name>
                <description>select value for AOI_16to8_15.
0: 0.
1: 1st_filter_out[15].
2: ~1st_filter_out[15].
3: 1</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_14</name>
                <description>select value for AOI_16to8_14.
0: 0.
1: 1st_filter_out[14].
2: ~1st_filter_out[14].
3: 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_13</name>
                <description>select value for AOI_16to8_13.
0: 0.
1: 1st_filter_out[13].
2: ~1st_filter_out[13].
3: 1</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_12</name>
                <description>select value for AOI_16to8_12.
0: 0.
1: 1st_filter_out[12].
2: ~1st_filter_out[12].
3: 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_11</name>
                <description>select value for AOI_16to8_11.
0: 0.
1: 1st_filter_out[11].
2: ~1st_filter_out[11].
3: 1</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_10</name>
                <description>select value for AOI_16to8_10.
0: 0.
1: 1st_filter_out[10].
2: ~1st_filter_out[10].
3: 1</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_9</name>
                <description>select value for AOI_16to8_9.
0: 0.
1: 1st_filter_out[9].
2: ~1st_filter_out[9].
3: 1</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_8</name>
                <description>select value for AOI_16to8_8.
0: 0.
1: 1st_filter_out[8].
2: ~1st_filter_out[8].
3: 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_7</name>
                <description>select value for AOI_16to8_7.
0: 0.
1: 1st_filter_out[7].
2: ~1st_filter_out[7].
3: 1</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_6</name>
                <description>select value for AOI_16to8_6.
0: 0.
1: 1st_filter_out[6].
2: ~1st_filter_out[6].
3: 1</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_5</name>
                <description>select value for AOI_16to8_5.
0: 0.
1: 1st_filter_out[5].
2: ~1st_filter_out[5].
3: 1</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_4</name>
                <description>select value for AOI_16to8_4.
0: 0.
1: 1st_filter_out[4].
2: ~1st_filter_out[4].
3: 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_3</name>
                <description>select value for AOI_16to8_3.
0: 0.
1: 1st_filter_out[3].
2: ~1st_filter_out[3].
3: 1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_2</name>
                <description>select value for AOI_16to8_2.
0: 0.
1: 1st_filter_out[2].
2: ~1st_filter_out[2].
3: 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_1</name>
                <description>select value for AOI_16to8_1.
0: 0.
1: 1st_filter_out[1].
2: ~1st_filter_out[1].
3: 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_16TO8_0</name>
                <description>select value for AOI_16to8_0.
0: 0.
1: 1st_filter_out[0].
2: ~1st_filter_out[0].
3: 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AOI_8to7_00_01</name>
            <description>CHN&amp;index0 AOI_16to8_00_01 OR logic cfg</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AOI_8TO7_01_7</name>
                <description>select value for AOI_8to7_01_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_6</name>
                <description>select value for AOI_8to7_01_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_5</name>
                <description>select value for AOI_8to7_01_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_4</name>
                <description>select value for AOI_8to7_01_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_3</name>
                <description>select value for AOI_8to7_01_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_2</name>
                <description>select value for AOI_8to7_01_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_1</name>
                <description>select value for AOI_8to7_01_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_01_0</name>
                <description>select value for AOI_8to7_01_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_7</name>
                <description>select value for AOI_8to7_00_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_6</name>
                <description>select value for AOI_8to7_00_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_5</name>
                <description>select value for AOI_8to7_00_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_4</name>
                <description>select value for AOI_8to7_00_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_3</name>
                <description>select value for AOI_8to7_00_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_2</name>
                <description>select value for AOI_8to7_00_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_1</name>
                <description>select value for AOI_8to7_00_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_00_0</name>
                <description>select value for AOI_8to7_00_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AOI_8to7_02_03</name>
            <description>CHN&amp;index0 AOI_16to8_02_03 OR logic cfg</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AOI_8TO7_03_7</name>
                <description>select value for AOI_8to7_03_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_6</name>
                <description>select value for AOI_8to7_03_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_5</name>
                <description>select value for AOI_8to7_03_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_4</name>
                <description>select value for AOI_8to7_03_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_3</name>
                <description>select value for AOI_8to7_03_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_2</name>
                <description>select value for AOI_8to7_03_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_1</name>
                <description>select value for AOI_8to7_03_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_03_0</name>
                <description>select value for AOI_8to7_03_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_7</name>
                <description>select value for AOI_8to7_02_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_6</name>
                <description>select value for AOI_8to7_02_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_5</name>
                <description>select value for AOI_8to7_02_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_4</name>
                <description>select value for AOI_8to7_02_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_3</name>
                <description>select value for AOI_8to7_02_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_2</name>
                <description>select value for AOI_8to7_02_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_1</name>
                <description>select value for AOI_8to7_02_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_02_0</name>
                <description>select value for AOI_8to7_02_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
