RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6280/HPM6280_svd.xml
          <register>
            <name>AOI_8to7_04_05</name>
            <description>CHN&amp;index0 AOI_16to8_04_05 OR logic cfg</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AOI_8TO7_05_7</name>
                <description>select value for AOI_8to7_05_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_6</name>
                <description>select value for AOI_8to7_05_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_5</name>
                <description>select value for AOI_8to7_05_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_4</name>
                <description>select value for AOI_8to7_05_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_3</name>
                <description>select value for AOI_8to7_05_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_2</name>
                <description>select value for AOI_8to7_05_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_1</name>
                <description>select value for AOI_8to7_05_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_05_0</name>
                <description>select value for AOI_8to7_05_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_7</name>
                <description>select value for AOI_8to7_04_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_6</name>
                <description>select value for AOI_8to7_04_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_5</name>
                <description>select value for AOI_8to7_04_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_4</name>
                <description>select value for AOI_8to7_04_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_3</name>
                <description>select value for AOI_8to7_04_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_2</name>
                <description>select value for AOI_8to7_04_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_1</name>
                <description>select value for AOI_8to7_04_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_04_0</name>
                <description>select value for AOI_8to7_04_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AOI_8to7_06</name>
            <description>CHN&amp;index0 AOI_16to8_06 OR logic cfg</description>
            <addressOffset>0x2c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>AOI_8TO7_06_7</name>
                <description>select value for AOI_8to7_06_7.
0: 0.
1: 2nd_filter_out[7].
2: ~2nd_filter_out[7].
3: 1</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_6</name>
                <description>select value for AOI_8to7_06_6.
0: 0.
1: 2nd_filter_out[6].
2: ~2nd_filter_out[6].
3: 1</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_5</name>
                <description>select value for AOI_8to7_06_5.
0: 0.
1: 2nd_filter_out[5].
2: ~2nd_filter_out[5].
3: 1</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_4</name>
                <description>select value for AOI_8to7_06_4.
0: 0.
1: 2nd_filter_out[4].
2: ~2nd_filter_out[4].
3: 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_3</name>
                <description>select value for AOI_8to7_06_3.
0: 0.
1: 2nd_filter_out[3].
2: ~2nd_filter_out[3].
3: 1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_2</name>
                <description>select value for AOI_8to7_06_2.
0: 0.
1: 2nd_filter_out[2].
2: ~2nd_filter_out[2].
3: 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_1</name>
                <description>select value for AOI_8to7_06_1.
0: 0.
1: 2nd_filter_out[1].
2: ~2nd_filter_out[1].
3: 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AOI_8TO7_06_0</name>
                <description>select value for AOI_8to7_06_0.
0: 0.
1: 2nd_filter_out[0].
2: ~2nd_filter_out[0].
3: 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>SECOND_FILTER_0,SECOND_FILTER_1,SECOND_FILTER_2,SECOND_FILTER_3,SECOND_FILTER_4,SECOND_FILTER_5,SECOND_FILTER_6,SECOND_FILTER_7</dimIndex>
            <name>FILTER_2ND[%s]</name>
            <description>no description available</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF71FF</resetMask>
            <fields>
              <field>
                <name>FILTER_EXT_COUNTER</name>
                <description>filter_ext counter value, cycles for filter or extent by system clock。
0：0*apb_clk_period
1：1*apb_clk_period
2: 2*apb_clk_period
…
65535: 65535*apb_clk_period</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EXT_TYPE</name>
                <description>filter extend type.
0-3：nothing to do.
4： input high level extend.
5： input low level extend.
6： output extend.
7： input pulse extend.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EXT_ENABLE</name>
                <description>filter extend enable.
0. bypass filter extend. all setting in bit31:12 are inactive
1. enable filter extend, all setting in bit31:12 are active.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_SYNC_LEVEL</name>
                <description>synchroniser level.
0: 2 level sync.
1: 3 level sync</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POSE_EDGE_DECT_ENABLE</name>
                <description>pose edge detector enable.
0: disable.
1: enable.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NEGE_EDGE_DECT_ENABLE</name>
                <description>nege edge detector enable.
0: disable.
1: enable.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EDGE_DECT_ENABLE</name>
                <description>edge detector enable.
0: disable. bit6/bit5 setting inactive.
1: enable. bit6/bit5 setting active.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_REVERSE</name>
                <description>reverse sync and edge detector filter's output.
0: not reverse.
1: reverse.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SOFTWARE_INJECT</name>
                <description>software inject value for sync and edge detector filter.
0: inject low level.
1: inject high level.
2: not inject.
3. inject high level.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_EDGE_FILTER_ENABLE</name>
                <description>sync and edge detector filter.
0: disable.
1: enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>7</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>THIRD_FILTER_0,THIRD_FILTER_1,THIRD_FILTER_2,THIRD_FILTER_3,THIRD_FILTER_4,THIRD_FILTER_5,THIRD_FILTER_6</dimIndex>
            <name>FILTER_3RD[%s]</name>
            <description>no description available</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF71FF</resetMask>
            <fields>
              <field>
                <name>FILTER_EXT_COUNTER</name>
                <description>filter_ext counter value, cycles for filter or extent by system clock。
0：0*apb_clk_period
1：1*apb_clk_period
2: 2*apb_clk_period
…
65535: 65535*apb_clk_period</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EXT_TYPE</name>
                <description>filter extend type.
0-3：nothing to do.
4： input high level extend.
5： input low level extend.
6： output extend.
7： input pulse extend.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EXT_ENABLE</name>
                <description>filter extend enable.
0. bypass filter extend. all setting in bit31:12 are inactive
1. enable filter extend, all setting in bit31:12 are active.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_SYNC_LEVEL</name>
                <description>synchroniser level.
0: 2 level sync.
1: 3 level sync</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POSE_EDGE_DECT_ENABLE</name>
                <description>pose edge detector enable.
0: disable.
1: enable.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NEGE_EDGE_DECT_ENABLE</name>
                <description>nege edge detector enable.
0: disable.
1: enable.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EDGE_DECT_ENABLE</name>
                <description>edge detector enable.
0: disable. bit6/bit5 setting inactive.
1: enable. bit6/bit5 setting active.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_REVERSE</name>
                <description>reverse sync and edge detector filter's output.
0: not reverse.
1: reverse.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SOFTWARE_INJECT</name>
                <description>software inject value for sync and edge detector filter.
0: inject low level.
1: inject high level.
2: not inject.
3. inject high level.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_EDGE_FILTER_ENABLE</name>
                <description>sync and edge detector filter.
0: disable.
1: enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_FF</name>
            <description>CHN&amp;index0 cfg ff</description>
            <addressOffset>0x6c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0003001F</resetMask>
            <fields>
              <field>
                <name>OSC_LOOP_CLAMP_VALUE</name>
                <description>osc loop clamp value when osc ring active.
0: clamp 0.
1: clamp 1.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_OSC_LOOP_CLAMP</name>
                <description>disable osc loop clamp.
0: enable osc loop clamp when osc ring active.
1: disable or clean current osc loop clamp.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_ADDER_MINUS</name>
                <description>0: select adder when cfg_adder_minus active.
1: select minus when cfg_adder_minus active.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_CLK_SOURCE</name>
                <description>cfg_ff clock source.
0: system clock.
1: use 3rd_filter_2 as clock.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_CFG_FF_TYPE</name>
                <description>cfg_ff type.
0: DFF.
1: 3rd_filter_0.
2: dual-edge DFF.
3: Trigger FF.
4: JK FF.
5. latch.
6: full adder/minus.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>FRIST_FILTER_PLA_IN_0,FRIST_FILTER_PLA_IN_1,FRIST_FILTER_PLA_IN_2,FRIST_FILTER_PLA_IN_3,FRIST_FILTER_PLA_IN_4,FRIST_FILTER_PLA_IN_5,FRIST_FILTER_PLA_IN_6,FRIST_FILTER_PLA_IN_7</dimIndex>
          <name>FILTER_1ST_PLA_IN[%s]</name>
          <description>no description available</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF71FF</resetMask>
          <fields>
            <field>
              <name>FILTER_EXT_COUNTER</name>
              <description>filter_ext counter value, cycles for filter or extent by system clock。
0：0*apb_clk_period
1：1*apb_clk_period
2: 2*apb_clk_period
…
65535: 65535*apb_clk_period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EXT_TYPE</name>
              <description>filter extend type.
0-3：nothing to do.
4： input high level extend.
5： input low level extend.
6： output extend.
7： input pulse extend.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EXT_ENABLE</name>
              <description>filter extend enable.
0. bypass filter extend. all setting in bit31:12 are inactive
1. enable filter extend, all setting in bit31:12 are active.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_SYNC_LEVEL</name>
              <description>synchroniser level.
0: 2 level sync.
1: 3 level sync</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSE_EDGE_DECT_ENABLE</name>
              <description>pose edge detector enable.
0: disable.
1: enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGE_EDGE_DECT_ENABLE</name>
              <description>nege edge detector enable.
0: disable.
1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_DECT_ENABLE</name>
              <description>edge detector enable.
0: disable. bit6/bit5 setting inactive.
1: enable. bit6/bit5 setting active.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_REVERSE</name>
              <description>reverse sync and edge detector filter's output.
0: not reverse.
1: reverse.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_INJECT</name>
              <description>software inject value for sync and edge detector filter.
0: inject low level.
1: inject high level.
2: not inject.
3. inject high level.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_EDGE_FILTER_ENABLE</name>
              <description>sync and edge detector filter.
0: disable.
1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
